$(document).ready(function () {
    //ovo ces da vidis u svim js fajlovima i to je da bi se podebljao link na kojem se trenutno nalazimo
    const navLinks = document.querySelectorAll('.navbar-nav .nav-link');
    navLinks.forEach(link => {
    if (link.href === window.location.href ||
        link.href.concat("#") === window.location.href) {
        link.classList.add('active');
    }
    });
    //ovde dodajem po kliku na dugme u paginaciji slike
              $("#link1").click(function(){
                $(".prva img").attr("src","slike/leonidSejka.jpg")
                $(".prva h3").text("Леонид Шејка");
                $(".prva p").text("Леонид Шејка (1932 — 1970) био је југословенски архитекта и сликар. Био је један од оснивача уметничке групе Медијала и учествао је на свим изложбама групе до 1970. године. Његова дела блиска су надреализму а на њима је заступљена богата симболика и дубока интелектуалност.");
                $(".druga img").attr("src", "slike/bijelicJovan.jpg");
                $(".druga h3").text("Јован Бијелић");
                $(".druga p").text("Јован Бијелић (Ревеник, 30. јуни 1884.— Београд, 12. март 1964) био је српски и југословенски сликар.Бијелић је један од најзначајнијих југословенских ликовних стваралаца између два светска рата и један од најзначајнијих српских представника колористичког експресионизма.");
                $(".treca img").attr("src", "slike/leonKolen.jpg");
                $(".treca h3").text("Леон Коен");
                $(".treca p").text("Леон Коен (Београд, 1859 – Вршац, 15. мај 1934) био је српски сликар. Најзначајнији је представник симболизма у Србији.Крајем 1896. године доживео је велики успех. Прву самосталну изложбу приредио је 1898. године у Београду, у згради Старе скупштине.");
            })
            $("#link2").click(function(){
                $(".prva img").attr("src","slike/djordjeJovanovic.jpg")
                $(".prva h3").text("Ђорђе Јовановић");
                $(".prva p").text("Ђорђе Ђока Јовановић (Нови Сад, 21. јануар 1861 — Београд, 23. март 1953) био је српски вајар и академик Српске академије наука и уметности.Као један од оснивача Уметничке школе, из које је касније настала Уметничка академија, Јовановић је био веома посвећен педагошком раду.");
                $(".druga img").attr("src", "slike/petarPavilicini.jpg");
                $(".druga h3").text("Петар Палавичини");
                $(".druga p").text("Петар Палавичини (Корчула, 15. јун 1887 — Дубровник, 22. октобар 1958) био је српски и југословенски вајар.Клесарски занат учио на Корчули, а вајарство на Вајарско-каменорезачкој школи у Хоржицама.");
                $(".treca img").attr("src", "slike/RistoStijovic.jpg");
                $(".treca h3").text("Ристо Стијовић");
                $(".treca p").text("Ристо Стијовић (Подгорица, 8. октобар 1894 — Београд, 20. децембар 1974) био је српски и југословенски вајар и академик САНУ.Студирао вајарство у уметничкој школи у Београду од 1912. до 1914, потом у Марсељу 1916 -1917 па у Паризу у „Школи лепих уметности“ од 1917. до 1923.");
                
            })
            $("#link3").click(function(){
                $(".treca img").attr("src","slike/vojinBakić.jpg")
                $(".treca h3").text("Војин Бакић");
                $(".treca p").text("Војин Бакић (Бјеловар, 5. јун 1915 — Загреб, 18. децембар 1992) је био српски вајар и сликар.Војин Бакић је без сумње један од највећих српских вајара 20. века, уметник европског формата: аутор који је успео да у авангардизма апстракције оствари монументалност и непосредност које су, традиционалистички гледано, обележја класичне фигуративне скулптуре.");
                $(".prva img").attr("src", "slike/petarPavilicini.jpg");
                $(".prva h3").text("Петар Палавичини");
                $(".prva p").text("Петар Палавичини (Корчула, 15. јун 1887 — Дубровник, 22. октобар 1958) био је српски и југословенски вајар.Клесарски занат учио на Корчули, а вајарство на Вајарско-каменорезачкој школи у Хоржицама.");
                $(".druga img").attr("src", "slike/RistoStijovic.jpg");
                $(".druga h3").text("Ристо Стијовић");
                $(".druga p").text("Ристо Стијовић (Подгорица, 8. октобар 1894 — Београд, 20. децембар 1974) био је српски и југословенски вајар и академик САНУ.Студирао вајарство у уметничкој школи у Београду од 1912. до 1914, потом у Марсељу 1916 -1917 па у Паризу у „Школи лепих уметности“ од 1917. до 1923.");
                
            })

    //додајемо клик на дугме 
    $(".btn").click(function(){
        let klasa = $(this).attr('id')+'a';
        let putanja=$("."+klasa).find("img").attr("src");
        let indeks=putanja.length-4;
        let putanja2="pdfovi/"+putanja.substring(6,indeks)+".pdf";
        window.open(putanja2, '_blank');
    })

});